update readme a bit
